>  you will configure Port Aggregation Protocol (PAgP), a Cisco EtherChannel protocol, and Link Aggregation Control Protocol (LACP), an IEEE 802.3ad open standard version of EtherChannel

# Link Aggregation / Etherchannel (Benefits)

- Redundancy = if one of the ports go down, the port channel will still be up
- Higher throughput = ST not blocking one of the ports
- Load balance

***

Furthermore on "channel-group X mode ____"
active - LACP unconditional
passive - LACP only if LACP device is detected
desirable - PAgP unconditional
auto - PAgP only if PAgP device is detected

***

_______________________________________________________

===VLAN Simulations - Section247===
Configure a layer2 Etherchannel between the switches as follows:

Configure interface fa0/23 and fa0/24 as 802.1Q trunk links between Switch1 and Switch2. Configure interfaces individually (fa0/23 and then fa0/24)
Set the trunk encapsulation to dot1q and then manually configure the port as a trunk port
Configure a Layer 2 EtherChannel between Switch1 and Switch2 on the inter-switch links. (fa0/23 and fa0/24)
Use Port-Channel no 12 (Tip: This is number twelve)
These links should not use dynamic EtherChannel negotiation.

```
Switch2> en
Switch2# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch2(config)# int f0/23
Switch2(config-if)# switchport trunk encapsulation dot1q
Switch2(config-if)# switchport mode trunk 
Switch2(config-if)# int f0/24
Switch2(config-if)# switchport trunk encapsulation dot1q
Switch2(config-if)# switchport mode trunk
Switch2(config-if)# int f0/23
Switch2(config-if)# channel-group 12 mode on
Switch2(config-if)# int f0/24
Switch2(config-if)# channel-group 12 mode on
```



```
===VLAN Simulations - Section248===
Configure interface fa0/23 and fa0/24 as 802.1Q trunk links between Switch1 and Switch2
Configure the interfaces individually.
Configure a Layer 2 EtherChannel between Switch1 and Switch2 on the inter-switch links. (fa0/23 and fa0/24).
Use PagP for dynamic negotiation
Switch1 should initiate negotiation and Switch2 should respond
Use Port-Channel no 12

**Basically... same as above except:
Switch1(config-if)# channel-protocol pagp (or lacp if it is asking for lacp)
Switch1(config-if)# channel-group 12 mode desirable

===VLAN Simulations - Section249===
Configure interface fa0/23 and fa0/24 as 802.1Q trunk links between Switch1 and Switch2
Configure a Layer 2 EtherChannel between Switch1 and Switch2 on the inter-switch links. (fa0/23 and fa0/24)
Use LACP for dynamic negotiation
Switch1 should initiate negotiation and Switch2 should respond
Use Port-Channel no 12

Switch1> en
Switch1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch1(config)# int f0/23
Switch1(config-if)# switchport trunk encapsulation dot1q
Switch1(config-if)# switchport mode trunk
Switch1(config-if)# int f0/24
Switch1(config-if)# switchport trunk encapsulation dot1q
Switch1(config-if)# switchport mode trunk
Switch1(config-if)# int f0/23
Switch1(config-if)# channel-protocol lacp
Switch1(config-if)# channel-group 12 mode active
Switch1(config-if)# int f0/24
Switch1(config-if)# channel-protocol lacp
Switch1(config-if)# channel-group 12 mode active

(??) ===VLAN Simulations - Section250===
Configure interface fa0/23 and fa0/24 on Switch1 and Switch2 as a Layer 3 EtherChannel.
Use Port-Channel no 12 and subnet 172.16.10.0/24
Switch1 = 172.16.10.1 ans Switch2 = 172.16.10.2

Switch1> en
Switch1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch1(config)# interface port-channel 12
Switch1(config-if)# no switchport
Switch1(config-if)# ip address 172.16.10.1 255.255.255.0
Switch1(config-if)# int f0/23
Switch1(config-if)# no switchport
Switch1(config-if)# channel-group 12 mode on
Switch1(config-if)# int f0/24
Switch1(config-if)# no switchport
Switch1(config-if)# channel-group 12 mode on
```



~The "no switchport" command puts the interface in L3 mode (known as "routed port") and makes it operate more like a "router interface" rather than a "switch port".

_____________________________________________

*Recall, if a port is link-type = "Shared", we can make convergence faster by making the port into a portfast
Switch3(config)#int g0/2
Switch3(config-if)#spanning-tree portfast

**Summary: To optimize your ST

1) Set all links to P2p Point-to-point
2) Set your edge ports(industry)/portfast (cisco) (ports connected to your edge devices) as Shared Edge

**Turning an interface (or switch) into a router
Switch1(config-if)#no switchport
*With routers, you can set ip address to interfaces (ex. g0/0), but with switches, you can only set VLANs

```
==Enable eigrp==
Switch1#conf t
Switch(config)#router eigrp 1
Switch(config-router)#network 0.0.0.0
==Configure Layer 3 switch Switch1 to allow routes advertised to Layer 3 switch Switch2 and vice versa==
Switch1#conf t
Switch1(config)#router eigrp 100
Switch1(config-router)#network 0.0.0.0
Switch1(config-router)#no auto-summary
Switch2#conf t
Switch2(config)#router eigrp 100
Switch2(config-router)#network 0.0.0.0
Switch2(config-router)#no auto-summary
```

**Summary of Switches & Routers:

- switchport is a Layer 2 Interface
- no switchport is a router Layer 3 Interface
- switch's IP address is configured via vlan (ex. vlan1)
- router's IP address is configured via interfaces (ex. g0/0)
- router ports do not run vlans, STP, DTP
- routers' interfaces are shut down by default
- routers block broadcast by default
  *router ports are used between routers and switches
  *vlans, switchports are used when traffic needs to be tagged throughout the network

```
==Created vlan 2 & 3, then place interface g0/0 in vlan2, g0/1 in vlan3==
Switch(config)#vlan 2
Switch(config-vlan)#vlan 3
Switch(config-vlan)#end
Switch#config t
Switch(config)#int g0/0
Switch(config-if)#switchport access vlan 2
Switch(config-if)#int g0/1
Switch(config-if)#switchport access vlan 3
==Set IP address to the vlans on SWITCHES==
Switch(config)#int g0/0
Switch(config-if)#ip address 10.1.2.254 255.255.255.0
Switch(config-if)#no shut
Switch(config-if)#int g0/1
Switch(config-if)#no shut
Switch(config-if)#ip address 10.1.3.254 255.255.255.0
==Set IP address to the vlans on PC==
PC(config)#int g0/0
PC(config-if)#no shut
PC(config-if)#ip address 10.1.2.1 255.255.255.0
PC(config-if)#exit
PC(config)#no ip routing [[since acting as PC but its really a router]]
PC(config)#ip default-gateway 10.1.2.254

==To enable layer 3 IP routing==
Switch(config)#ip routing

==Random troubleshooting - Show commands==
Switch1#show cdp neighb
Switch1#show ip interface brief
Switch1#show ip protocol
Switch1#show ip eigrp int
Switch1#show interface trunk
Switch1#show vlan brief
Switch1#show vtp status
Switch1#show controllers serial X
Switch1#show mac address-table
Switch1#debug ip icmp
```

# requirement

1. host :S1
2. host :s2
3. host :s3

## flow : trunk:channel:int:mode

int fxxx
switchport mode trunk
channel group 1 mode active/desirable
int port channel 1 
switch port mode trunk

## IP assign

fas :21-22 : PAGP P01
Giga:01-2: LACP p02
fast:23-24 : LACP  P03

## check status : verify the existing configuration of the ports that connect the switches to ensure that the ports will successfully join the EtherChannels.
```
S1# show interfaces | include Ethernet
S1# show interface status
S1# show interfaces trunk
```

note 1:  DTP can be disabled on interfaces with the switchport nonegotiate command.
note 2:  If the ports are configured with DTP dynamic auto mode, and you do not set the mode of the ports to trunk.

## forming trunk

```
S1(config)#int range f0/21-22
S1(config-if-range)#switchport mode trunk

S1(config-if-range)#interface range g0/1-2
S1(config-if-range)#switchport mode trunk

S3(config)#interface range f0/21-24
S3(config-if-range)#switchport mode trunk
```

## checking trunk

```


S1#sh int trunk 
Port        Mode         Encapsulation  Status        Native vlan
Fa0/21      on           802.1q         trunking      1
Fa0/22      on           802.1q         trunking      1
Gig0/1      on           802.1q         trunking      1
Gig0/2      on           802.1q         trunking      1

Port        Vlans allowed on trunk
Fa0/21      1-1005
Fa0/22      1-1005
Gig0/1      1-1005
Gig0/2      1-1005

Port        Vlans allowed and active in management domain
Fa0/21      1
Fa0/22      1
Gig0/1      1
Gig0/2      1

Port        Vlans in spanning tree forwarding state and not pruned
Fa0/21      1
Fa0/22      1
Gig0/1      1

```



## making mode desirable (PAGP) configure port channel 1

```
S1(config)# interface range f0/21 â€“ 22
S1(config-if-range)# shutdown
S1(config-if-range)# channel-group 1 mode desirable
S1(config-if-range)# no shutdown

S3(config)# interface range f0/21 - 22
S3(config-if-range)# shutdown
S3(config-if-range)# channel-group 1 mode desirable
S3(config-if-range)# no shutdown
```

note : When configuring EtherChannels, it is recommended to shut down the physical ports being grouped on both devices before configuring them into channel groups. Otherwise, EtherChannel Misconfig Guard may place these ports into err-disabled state. The ports and port channels can be re-enabled after EtherChannel is configured

##  configure logical inter

```
S1(config)# interface port-channel 1
S1(config-if)# switchport mode trunk

S3(config)# interface port-channel 1
S3(config-if)# switchport mode trunk

S1#sh etherchannel summary 
Flags:  D - down        P - in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 2
Number of aggregators:           2

Group  Port-channel  Protocol    Ports
------+-------------+-----------+----------------------------------------------

1      Po1(SD)           PAgP   Fa0/21(I) Fa0/22(I) 
2      Po2(SU)           LACP   Gig0/1(P) Gig0/2(P) 
```


# configure port channel 2 (LACP) 802.3ad LACP

```
S1(config)# interface range g0/1 - 2
S1(config-if-range)# shutdown
S1(config-if-range)# channel-group 2 mode active
S1(config-if-range)# no shutdown
S1(config-if-range)# interface port-channel 2
S1(config-if)# switchport mode trunk

S2(config)# interface range g0/1 - 2
S2(config-if-range)# shutdown
S2(config-if-range)# channel-group 2 mode active
S2(config-if-range)# no shutdown
S2(config-if-range)# interface port-channel 2
S2(config-if)# switchport mode trunk
```

# configure port channel 3(LACP passive) Redundant EtherChannel Link

```
S2(config)# interface range f0/23 - 24
S2(config-if-range)# shutdown
S2(config-if-range)# channel-group 3 mode passive
S2(config-if-range)# no shutdown
S2(config-if-range)# interface port-channel 3
S2(config-if)# switchport mode trunk


S1#sh spanning-tree active
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0001.C770.A342
             This bridge is the root
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0001.C770.A342
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type

---------------- ---- --- --------- -------- --------------------------------

Po2              Desg FWD 3         128.28   Shr
Fa0/22           Desg FWD 19        128.22   P2p
Fa0/21           Desg FWD 19        128.21   P2p
```




Note : Creating EtherChannel links does not prevent Spanning Tree from detecting switching loops. View the spanning tree status of the active ports on S1

## make switch 1 as a master

Note : Port Channel 2 is not operative because Spanning Tree Protocol placed some ports into blocking mode. Unfortunately, those ports were the Gigabit ports. In this topology, you can restore these ports by configuring S1 to be primary root for VLAN 1. You could also set the priority to 24576.

```
S1(config)# spanning-tree vlan 1 root primary
```



EtherChannel Configuration Guidelines and Restrictions
EtherChannel has some specific guidelines that must be followed in order to avoid configuration problems.

1) All Ethernet interfaces support EtherChannel up to a maximum of eight interfaces with no requirement that the interfaces be on the same interface module.

2) All interfaces within an EtherChannel must operate at the same speed and duplex.

3) EtherChannel links can function as either single VLAN access ports or as trunk links between switches.

4) All interfaces in a Layer 2 EtherChannel must be members of the same VLAN or be configured as trunks.

5) If configured as trunk links, Layer 2 EtherChannel must have the same native VLAN and have the same VLANs allowed on both switches connected to the trunk.

6) When configuring EtherChannel links, all interfaces should be shutdown prior to beginning the EtherChannel configuration. When configuration is complete, the links can be re-enabled.

7) After configuring the EtherChannel, verify that all interfaces are in the up/up state.

8. It is possible to configure an EtherChannel as static, or for it to use either PAgP or LACP to negotiate the EtherChannel connection. The determination of how an EtherChannel is setup is the value of the channel-group number mode command. Valid values are:

   active         LACP is enabled unconditionally
   passive      LACP is enabled only if another LACP-capable device is connected.
   desirable   PAgP is enabled unconditionally
   auto            PAgP is enabled only if another PAgP-capable device is connected.
   on               EtherChannel is enabled, but without either LACP or PAgP.

9. LAN ports can form an EtherChannel using PAgP if the modes are compatible. Compatible PAgP modes are:

desirable => desirable
desirable => auto

If both interfaces are in auto mode, an Etherchannel cannot form.

10) LAN ports can form an EtherChannel using LACP if the modes are compatible. Compatible LACP modes are:

active => active
active => passive

If both interfaces are in passive mode, an EtherChannel cannot form using LACP.

11) Channel-group numbers are local to the individual switch. Although this activity uses the same Channel-group number on either end of the EtherChannel connection, it is not a requirement. Channel-group 1 (interface po1) on one switch can form an EtherChannel with Channel-group 5 (interface po5) on another switch.