> Cisco Router
> **Currently, Cisco routers copies the entire Cisco IOS into RAM during boot process
> ==Information==
> R1#show version
> R1#show flash
> R1#show run
> R1#show start
> R1#erase start
> ==Copy running-config to flash==
> R1#sh run | redirect flash:/showruntest.cfg
> To view this new file
> R1#more flash:/showruntest.cfg

ROM Read-Only Memory
- ROM stores the routers bootstrap startup program, operating system software, and power-on diagnostic test programs (the POST)
- 'ROM Monitor' used for password recovery, Router Disaster Recovery, Upload Router OS - think 'Safe Mode'

Flash (Non-Volatile)
- Flash is erasable and reprogrammable ROM (permanent storage)
- Flash memory content is retained by the router on power-down or reload

RAM (Volatile)
- RAM on a Cisco router stores operational information such as routing tables and the running configuration file. 
- RAM contents are lost when the router is powered down or reloaded
- RAM holds the running configuration file
**How much ram in R1#show version ... 239616K/22528K bytes of memory?
> 239616+22538=262154
> 262154/1024=256
> 256Mbs ram

NVRAM (Non-Volatile)
- If NVRAM is empty, you will be prompted to enter setup mode
- NVRAM holds the startup configuration file (configuration register)

Configuration Register
**16 bits
R1#show version
> Configuration register is 0x2102 (default)
> This is in hexadecimal because of '0x'
> 0010 0001 0000 0010
> The last digit is how the router boots = 'boot field'
> ==Change register to 0x2100==
> R1(config)#config-register 0x2100
> 0x2100 is ROMMON mode, because last digit of 'boot field' of 0 is ROMMON

boot field (last digit)
0 = ROMMON
1 = ROM/Flash
2 = Cisco IOS

***Memoriable for CCNA
0x2102 to 0x210F - Normal Mode
0x2101 - RxBoot Mode (boot using first OS in flash)
0x2100 - ROMMON Mode
0x2142 - Bypass Startup Config

**How Cisco routers locate boot configuration
1) Checks for boot field
2) If not boot field, boots in Flash and boots in 1st IOS image
3) If no file in flash, boots from TFTP server (using 'slop')
4) If none is available, then loads ROMMON

Cisco IOS IFS Integrated File System
==Create directory (flash) similar to Windows explorer/folders==
R1#mkdir flash:/test (make directory)
==Redirect running-config to that flash file above==
R1#show running-config | redirect flash:/test/shrun.cfg
==Read that file in that directory==
R1#more flash:/test/shrun.cfg

Cisco IOS systems
R1#show file systems
*'opaque' is for internal functions/commands
*'network' is external file system of different servers
*'disk' is used for flash
*'nvram' is used for start-up config
==Copy nvram file to flash==
R1#copy nvram:startup-config flash:/copystart.cfg
==Backup IOS to TFTP Server==
R1#copy flash:insertFileNameHere tftp:insertIPAddyHere
**Note. TFTP has not security mechanism. SecureCopy has security.
==Upgrade IOS image from TFTP server==
> Make sure flash has enough space
> R1#show flash
> Copy image from TFTP to flash
> R1#copy tftp: flash:
> Once done, reboot
> R1# boot system flash: fileNameHere

Cisco IOS naming conventions
ex. c2900-universalkh-mz.SPA-152.4.M1.bin
c2900 = Platform 2900 Cisco Router
universal k9 = Universal feature set
mz = File format- m(runs in RAM), z(compressed)
SPA = Special Image, Production (approved production image), A (key version A,B,C)
152-4.M1 = Software verison number