# ACL Access Control List

- Used to permit/deny packets moving through a router

## ACL Process
**ACL goes through a sequential list (permit, deny)
**Must have at least one permit statement, otherwise might as well unplug the cable

1) No ACL permit match? Goes to next line in the sequential list
- If next line, ACL permits? Permit, process stops
- If next line, ACL does not permit? Deny, process stops
2) If no ACL permit match by the end of the sequential list? Implicit deny, process stops

Inbound ACL:
- ACL determines whether to allow/deny traffic before it hits router
1) ACL -> 2) Router
Outbound ACL:
1) Router -> 2) ACL
**It is more efficient to bind an ACL for inbound traffic

ACL uses:
1) IPSec tunneling - ACL determines which routes need to be encrypted
2) Redistribute routing protocols - ACL determines which routing protocols such as EIGRP needs to be redistributed to EIGRP. Not all EIGRP needs to be redistributed, therefore ACL can control which ones need to be redistributed
3) NAT - ACL controls which set of routes need to be translated

Standard ACL
- Checks source IP Address ONLY
- Permits or denies entire protocol suite
- Numbered 1-99, 1300-1999
- Names (you specify)
*Remark = ACL description in IOS

Extended ACL
- Checks source IP Address and Destination IP Address
- Permits or denies individual protocols, applications, ports, etc...
- Numbered 100-199, 2000-2699
- Names (you specify)

Wildcard masks - Standard/Extended ACL
- ACL use inverse mask (opposite of Network Mask)
Binary:
0 = match
1 = ignore
ex. Match a specific address "access-list 1 permit 10.1.1.1 0.0.0.0" or "access-list 1 permit host 10.1.1.1"
Address|Mask
10|0 (match)
1|0 (match)
1|0 (match)
1|0 (match)
ex. Match anything "access-list 1 permit 0.0.0.0 255.255.255.255" or "access-list 1 permit any"
ex. Match subnet 0.0.0.Anything "access-list 1 permit 10.1.1.0 0.0.0.255"
10|0 (match)
1|0 (match)
1|0 (match)
0|255 (anything)
ex. Ignore last 4 bits of last octet "access-list 1 permit 10.1.1.0 0.0.0.15"
10|0 (match)
1|0 (match)
1|0 (match)
0|15 0000 1111 (8 4 2 1 = 15), the last 4 binary bits can be set to anything
Therefore, 10.1.1.1 will match 0.0.0.15 because 0000 0001 permitted by 0000 1111
But... 10.1.1.129 will not match 0.0.0.15 because 1000 0001, the issue is 1000 does not match 0000

**Remember, an access list has to bind in order for it to be active. You can create all the access list you want, but if you don't activate it, then you might as well delete it
**Also, non-existent access list can be bind to interfaces - bad practice, do not to have access list bind if the access list does not exist 
**Order of processing is important. ACL is top-down process
ex. (b) would not be evaluated 
a) access-list 1 permit all
b) access-list 1 deny host 10.1.1.1
**Standard ACL: Placement of ACLs closest to destination - prevent any unwanted deny because it only accounts for source IP 
**Extended ACL: Placement of ACLs closest to source - does not matter because it accounts for both source and destination IP along with its with protocols

````
==Permit 10.1.1.1 in ACL==
R1#conf t
R1(config)#access-list 1 permit 10.1.1.1 0.0.0.0
==Show IP access list==
R1#show ip access-lists
==Permit 10.1.2.3 in ACL, deny everyone else on int f0/0==
R1(config)#access-list 2 permit 10.1.2.3 0.0.0.0 or permit host 10.1.2.3
R1(config)#int f0/0
````

```
> Set inbound ACL to be ACL list 1, and ACL list 3 to permit all traffic
> R1(config-if)#ip access-group 1 in
> R1(config-if)#end
> R1(config)#access-list 3 permit any
> R1(config)#int f0/0
> R1(config-if)#ip access-group 3 out
> Confirm this
> R1#show ip int f0/0
> ==Add remark==
> R1(config)#access list 5 remark (Add In Your Comment Here)
> See remark (show ip access-lists does not work)
> R1#show run | i access-list

==Standard ACL==========================================
10.1.1.1 + 10.1.1.2 <-> f0/0 R1 f0/1 <-> 10.1.2.1 server
```

Permit host 10.1.1.1 to server 10.1.2.1
Deny everyone else to server 10.1.2.1
Allow traffic to other server

```
R1#conf t
R1(config)#access-list 4 permit 10.1.1.1 0.0.0.0
R1(config)#int f0/1
R1(config-if)#ip access-group 4 out
```

==Standard ACL==========================================
10.1.1.1 <-> f0/0 R1 f0/1 <-> 10.1.2.1 server

Permit subnet 10.1.1.0/24
Deny everyone else

```
R1#conf t
R1(config)#access-list 5 10.1.1.0 0.0.0.255
R1(config)#int f0/0
R1(config-if)#ip access-group 5 in
```

==Standard ACL==========================================
10.1.1.1 <-> f0/0 R1 f0/1 <-> 10.1.2.1 server

Permit 10.1.1.1 to telnet to router
Deny everyone else telnet to router
Allow traffic anywhere else
**Standard control list has no access to permit/deny protocols, since this is telnet, we have to permit is inside vty line

```
R1#conf t
R1(config)#access-list 6 permit 10.1.1.1
R1(config)#line vty 0 4
R1(config-line)#access-class 6 in
```



==Extended ACL==========================================
10.1.1.1 <-> f0/0 R1 s0/0 <-> s0/0 R2 f0/0 <-> 10.1.2.1 server

Permit http traffic from 10.1.1.1 to 10.1.2.1
Deny all other traffic from subnet 10.1.1.0/24 to server 10.1.2.1
Permit all other traffic from subnet anywhere else
*Recall 100-199 = extended ACL

```
R1#conf t
R1(config)#access-list 100 permit tcp 10.1.1.1 0.0.0.0 host 10.1.2.1 eq 80 (or www)
R1(config)#access-list 100 deny ip 10.1.1.0 0.0.0.255 host 10.1.2.1
R1(config)#access-list 100 permit ip 10.1.1.0 0.0.0.255 any
R1(config)#int f0/0
R1(config-if)#ip access-group 100 in
```

==Extended ACL==========================================
10.1.1.1 <-> f0/0 R1 s0/0 <-> s0/0 R2 f0/0 <-> 10.1.2.1 server

Permit http and tftp traffic from subnet 10.1.1.0/24 to server 10.1.2.1
Deny all other traffic from subnet 10.1.1.0/24 to server 10.1.2.1
Permit all other traffic from subnet anywhere else



```
R1#conf t
R1(config)#access-list 101 permit tcp 10.1.1.0 0.0.0.255 host 10.1.2.1 eq 80
R1(config)#access-list 101 permit udp 10.1.1.0 0.0.0.255 host 10.1.2.1 eq 69
OR
R1(config)#access-list 101 permit udp 10.1.1.0 0.0.0.255 10.1.2.1 0.0.0.0 eq 69
R1(config)#access-list 101 deny ip 10.1.1.0 0.0.0.255 host 10.1.2.1
OR
R1(config)#access-list 101 deny ip 10.1.1.0 0.0.0.255 10.1.2.1 0.0.0.0
R1(config)#access-list 101 permit ip 10.1.1.0 0.0.0.255 any
R1(config)#int f0/0
R1(config-if)#ip access-group 101 in
```



==Extended ACL==========================================
10.1.1.1 <-> f0/0 R1 s0/0 <-> s0/0 R2 f0/0 <-> 10.1.2.1 server

Permit http and tftp traffic from anywhere to server 10.1.2.1
Deny all other traffic to server 10.1.2.1

```
R2#conf t
R2(config)#access-list 102 permit tcp any (0.0.0.0 255.255.255.255) 10.1.2.1 0.0.0.0 eq 80
R2(config)#access-list 102 permit udp any 10.1.2.1 0.0.0.0 eq 69
R2(config)#access-list 102 deny ip any 10.1.2.1 0.0.0.0
R2(config)#int f0/0
R2(config)#ip access-group 102 out
```

==Edit individual line numbers on ACL==

````
View ACL 102
R1#show access-list 102
10 permit...
20 permit...
30 deny...
Remove 30
R1#conf t
R1(config)#ip access-list extended 102
R1(config)#no 30
````