# Private address space (IANA Internet Assigned Numbers Authority)

/8 10.0.0.0 - 10.255.255.255
/12 172.16.0.0 - 172.31.255.255
/16 192.168.0.0 - 192.168.255.255

- Non routable
- ISP blocked and dropped

# NAT Network Address Translation

- IPv4 exhausted RFC1918
- Private address translated to Public address to be used on the internet

PAT Port Address Translation

- 1 public IP address used by 500 internal devices (Overloading the address)

3 types of NAT - Overloading:

1) Static NAT
- Permanent
- 1-1 mapping: private IP to public IP
2) Dynamic NAT
- Not Permanent 
- NAT translations are automatically created and torned down when not needed (mapping will be removed once communication ends) - times out by itself
- A pool of Public IP addresses is available for use internally by Private IP addresses. Router dynamically allocates public IP addresses (on as needed basis)
3) PAT
- maps multiple private IP addresses to a single public IPv4 address
- uses Port Numbers to differentiate between different translations
- a.k.a NAT Overloaading (single IP address with multiple IP addresses)
- it is a type of Dynamic NAT

Inside Local - Our private IP address
Inside Global - Our public IP address
Outside Local - Destination private IP address
Outside Global - Destination public IP address

==Static NAT Setup==
R1 10.1.1.1 /24 <-> f0/0 10.1.1.2 /24 R2 f0/1 8.1.1.1 /24<-> 8.1.1.2 /24 R3

```
Setup outside NAT
R2#conf t
R2(config)#int f0/1
R2(config-if)#ip nat outside
Setup inside NAT
R2(config)#int f0/0
R2(config-if)#ip nat inside
R2(config-if)#end
Setup random address for this ex.
R2(config)#ip nat inside source static 10.1.1.1 8.1.1.5 (Inside Global, Inside Local)
==Show NAT==
R2#show ip nat translations
==Watch NAT in action==
R3#ping 8.1.1.5 (5/5 successful pings!)
**Reason this works is because R3 thinks 8.1.1.5 is real, but actually 8.1.1.5 is the inside translation for 10.1.1.1)
Similarly...
R3#telnet 8.1.1.5 (This Telnets to 10.1.1.1 and can be confirmed below.
R1#conf t
R1(config)#line vty 0 5
R1(config-line)#login
R1(config-line)#password cisco
R1(config-line)#end
R1(config)#enable password cisco
```

==Dynamic NAT Setup==
R1 10.1.1.1 /24 <-> f0/0 10.1.1.2 /24 R2 f0/1 8.1.1.1 /24<-> 8.1.1.2 /24 R3

```
> Setup outside NAT
> R2#conf t
> R2(config)#int f0/1
> R2(config-if)#ip nat outside
> Setup inside NAT
> R2(config-if)#int f0/0
> R2(config-if)#ip nat inside
> R2(config-if)#end
> Setup ACL and NAT-POOL
> R2(config)#ip nat pool NAT-POOL (nameHere) 8.1.1.5 8.1.1.10 (range) netmask 255.255.255.0
> R2(config)#ip nat inside source list 1 pool NAT-POOL
> R2(config)#access-list 1 permit 10.1.1.0 0.0.0.255
```

==Clear NAT translations==

```
R2#clear ip nat translations
```

==PAT Setup (NAT Overloading)==

```
> Setup outside NAT
> R2#conf t
> R2(config)#int f0/1
> R2(config-if)#ip nat outside
> Setup inside NAT
> R2(config-if)#int f0/0
> R2(config-if)#ip nat inside
> R2(config-if)#end
> Setup PAT / NAT Overloading
> R2(config)#access-list 1 permit 10.1.1.0 0.0.0.255
> R2(config)#ip nat inside source list 1 interface fastEthernet 0/1 overload
```

> **Static and Dynamic NAT is not good for when your network has 100 devices. This is when NAT Overloading is beneficial
> **PAT Port Address Translation is able to differentiate the sessions based on Port Number, hence the term Port Address Translation
> **In previous examples, we NAT to the Router's IP address, we will now NAT to a Public IP address
> **TDLR: Static NAT, Dynamic NAT = everytime a device wants to send data out, it will need a public IP address
> **TDLR: Therefore, PAT is more useful because it is NAT overloading and uses 1 public IP address with different ports (hence, 'Port Address' translation) for each private IP device

__________________________________________________________

===NAT Simulations - Section447===
Server 10.1.1.1 <-> f0/0 Router1 s0/0 <-> Internet
Enable Static NAT so users on the Internet can access the Web server 10.1.1.1 as follows:

Create a NAT translation on the router for the server
The inside global address is 192.168.1.2 (assume that this is a valid address)
Configure the Serial interface as the outside interface
Configure the FastEthernet interface as the inside interface

```
Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# ip nat inside source static 10.1.1.1 192.168.1.2
Router1(config)# int s0/0
Router1(config-if)# ip nat outside
Router1(config-if)# int f0/0
Router1(config-if)# ip nat inside
```

===NAT Simulations - Section448===
Server 10.1.1.1 <-> f0/0 Router1 s0/0 <-> Internet
Enable Static NAT so users on the Internet can access the Web Server 10.1.1.1 as follows:

Create NAT translation on the router for the server. The inside global address is 1.2.3.4
Configure the Serial interface as the outside interface
Configure the Fast Ethernet interface as the inside interface

```
Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# ip nat inside source static 10.1.1.1 1.2.3.4
Router1(config)# int s0/0
Router1(config-if)# ip nat outside
Router1(config-if)# int f0/0
Router1(config-if)# ip nat inside
```

===NAT Simulations - Section449===
Server 10.1.1.0/24 <-> f0/0 Router1 s0/0 <-> Internet
Configure Dynamic NAT using a pool on the Router as followings:

Step 1: Create a nat pool with the name "natpool" with address range: 192.168.1.1 to 192.168.1.10 and netmask 255.255.255.240
Step 2: Bind access list 1 to the nat pool
Step3: Create access list 1 and permit network 10.1.1.0/24
Step 4: Configure interface Serial 0/0 as the outside interface
Step 5: Configure interface FastEthernet 0/0 as the inside interface

```
Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# ip nat pool natpool 192.168.1.1 192.168.1.10 netmask 255.255.255.240
Router1(config)# ip nat inside source list 1 pool natpool
Router1(config)# access-list 1 permit 10.1.1.0 0.0.0.255
Router1(config)# int s0/0
Router1(config-if)# ip nat outside
Router1(config-if)# int f0/0
Router1(config-if)# ip nat inside
```

===NAT Simulations - Section450===
Server 10.1.1.0/24 <-> f0/0 Router1 s0/0 <-> Interne
Configure the router with PAT so that hosts in the 10.1.1.0/24 subnet can access the access the Internet:

Step 1: Create the PAT translation using the Serial 0/0
Step 2: Configure access list 1 to permit network 10.1.1.0/24
Step 3: Configure Serial 0/0 as the outside interface
Step 4: Configure FastEthernet 0/0 as the inside interface

```
Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# ip nat inside source list 1 interface serial 0/0 overload
Router1(config)# access-list 1 permit 10.1.1.0 0.0.0.255
Router1(config)# int s0/0
Router1(config-if)# ip nat outside
Router1(config-if)# int f0/0
Router1(config-if)# ip nat inside
```

==NAT setup==

```
f0/0 R1 f0/1 <-> Cloud
R1#conf t
R1(config)#int f0/1
R1(config-if)#ip nat outside
R1(config-if)#int f0/0
R1(config-if)#ip nat inside
R1(config-if)#exit
```

==PAT / NAT Overload Access List setup==

```
Permit all devices on the 10 network
R1(config)#ip nat inside source list 1 interface f0/1 overload
R1(config)#access-list 1 permit 10.0.0.0 0.255.255.255
==Enable DNS==
R1(config)#ip domain-lookup
R1(config)#ip name-server 8.8.8.8
```
