OSPF Open Shortest-Path First

- Mix routes between diff vendors

- Dijkstra Algorithm used for determining best route to destination

- Link state running protocol
  
  > Link: router interface
  > State: description of interface and its relationship to neighboring routers

- Collection of Link State = topological database / link state database

- Create neighbors by sending out Hellos using multicast 224.0.0.5 or unicast

- Above layer 3 (IP), below layer 4 (TCP 6/UDP 17)

- Port 89

- Default, synchronized every 30 minutes

OSPF Tables

1) IP OSPF Neighbor Table 
- List of neighbors shown in Adjacency Table / OSPF Neighbor Table
  ==Show Table=
  R1#show ospf neighbors
2) IP OSPF Topology Database (LSDB Link State Database)
- LSDB contains all routers and attached links in area/network
- All OSPF routers in the same area share the same database
3) IP Routing Table (Forwarding Table)
- Best routes are placed here

OSPF Packet Types

1) Hello
- Dynamically discover neighbors, forms and maintains those neighbors
- Discover Frequency: Ethernet (10 seconds)
- Discover Frequency: Serial/NBMA Non-broadcast multi-access environment (30 seconds)
- Dead Timer (if no response to Discover within Dead Timer, relationship is torn down)-> 4 times the Hello interval
2) DD/DBD Database Description
- Brief overview of LSA Link State Advertisements
3) LSR Link State REquest 
- If DD/DBD is missing information, request for FULL LSA information
4) LSU Link State Update
- Contains FULL LSAs in response to LSR
5) LSAck Link State Acknowledgement 
- Confirm receipt of LSU

OSPF Hierarchy (Areas)

- OSPF's network is its own AS
- When multiple OSPF's are used, they are broken up into Areas (Area 0 is the back bone - all traffic will traverse the backbone)
  **Both sides of the link must be in the same Area
- Cisco recommends no more than 50 routers in a single Area
- Areas are useful in stopping the flood of LSA by breaking up the network into multiple areas
- Routers that border the backbone area and another area is known as ABR Area Border Routers 
- ABRs are also backbone routers
- Routers that borders 2 AS (could be same or different routing systems), are call ASBR Autonomous Systems Border Routers (could be RIP and EIGRP)

OSPF ABR

- BENEFITS: Summarization of routes
  ex. Area 1: 10.1.1.0/24 - 10.1.100.0/24, the ABR can summarize the routes as 10.1.0.0 /16
  ex. Area 1: 10.2.1.0/24 - 10.2.100.0/24, the ABR can summarize the routes as 10.2.0.0 /16

OSPF Router ID

- Chosen based on:
1) Manual configuration
2) Highest Loopback interface (never go down) 
3) Highest IP address (physical interface) 
4) Everything else

==Specify OSPF Router ID==

> High IP address is 10.1.1.1
> *****using ospf 1 is local to the router, it does not need to match other routers
> R1#conf t
> R1(config)#router ospf 1
> ==Refresh OSPF Router ID (assume there is a higher IP address than current)==
> R1(config)#no router ospf 1
> R1(config)#router ospf 1
> ==Manual OSPF Router ID==
> R1(config)#router ospf 1
> R1(config-router)#router-id 192.168.1.1 (arbitrary)
> ==Setup OSPF Network==
> This step is needed, otherwise OSPF will not work
> R1(config-router)#network 10.1.1.0 0.0.0.255 area 0
> ==Show OSPF info==
> R1#show ip ospf int
> R1#show ip ospf int brief
> R1#show ip ospf neighbor
> R1#show ip ospf database
> ==Enable OSPF inside interface==
> R1(config)#int g0/0
> R1(config)#ip address 10.1.1.0 0.0.0.255
> R1(config-if)#ip ospf 1 area 0 (?)
> ==Configure OSPF timers==
> To adjust timers, simply adjust it to Broadcast, it might be set to Non-Broadcast
> R1(config)#int g0/0
> R1(config-if)#ip ospf network broadcast

OSPF Hello Packet

> Must be the same:

1) Hello and Dead intervals
2) Area ID
3) Authentication password
4) Stub area flag

OSPF DR Designated Router

- Criteria for DR: Chosen based on highest priority
  *Priority is from 1-255 (0 excludes the router from being a DR) - default = 1, disable = 0
- DR/BDR can see 224.0.0.6 multicast update
- All other routers sees 224.0.0.5

OSPF DR Process
R1 (DR) <-> R2 (BDR Backup DR) <-> R3,4,5,6

1) R1 goes down, R1 updates R2 through multicast 224.0.0.6
2) R2 receives multicast 224.0.0.5, that R1 went down
3) R2 sends multicast 224.0.0.5 to all OSPF routers R3,4,5,6
4) All active OSPF routers are now acknowledged that network has gone down
   **If no DR, then all routers are adjaceny routers and all routers will multicast to each other (saves update and duplicated traffic)
   **Only Main DR and Backup DR has full relationships with all OSPF routers
   **Every ethernet segment requires the maintenance and electric of its own DR (10.1.1.0/24 and 10.1.2.0/24 are two different)
   ***DR is not preemptive (ex. if R2 (priority 10) goes down and R5 (priority 5) becomes DR and R3 becomes BDR and if R2 comes back online, R2 will not become DR again because DR already exist even though R2 has highest priority - not preemptive. R2 will become DRO DR Other) - will not host another election

OSPF SPF Algorithm

- Default reference bandwidth = 100mbps (cost of 1)
- Cost = 10^8 / bandwidth 
  (Note: Bandwidth of 10Mbps = 10,000,000bps, therefore Cost of 10Mbps = 100,000,000 / 10,000,000 = 10)
  (Note: Bandwidth of 1.544Mbps = 15,440,000bps, Cost = 64)

==Change reference bandwidth==
R1(config)#auto-cost reference-bandwidth X
==Change cost of an interface==
R1(config-if)#ip ospf cost X

OSPF stub nssa

- stub stubby area (i.e. loopback)
- nssa not so stubby area
- stub and nssa is used for reducing the routes in the routing table
  Note: "Initial SPF schedule delay 5000 msecs" - when a network is going down or a new network is added, OSPF will wait 5 seconds allowing OSPF to stablize before running the new SPF algorithm

*****

==Total OSPF setup==
R1#conf t
R1(config)#interface f0/0
R1(config-if)#ip address 10.1.1.1 255.255.255.0
R1(config-if)#no shut 
R1(config-if)#interface f0/1
R1(config-if)#ip address 10.1.2.1 255.255.255.0
R1(config-if)#no shut 
R1(config-if)#router ospf 1
R1(config-router)#network 10.1.1.1 0.0.0.0 area 0
R1(config-router)#network 10.1.2.1 0.0.0.0 area 0
R1(config-router)#interface loop 0
R1(config-if)#ip address 1.1.1.1 255.255.255.255
R1(config-if)#router ospf 1
R1(config-router)#network 1.1.1.1 0.0.0.0 area 0

> OR enable all networks [R1(config-router)#network 0.0.0.0 255.255.255.255 area 0]
> *Routers that are connected to each other (usually via Serial) is Point-to-Point. 
> **Point-to-Point does not require an election
> ***Even if loopback's network is not a part of the OSPF interface, loopback's network will be the Router ID
> ==Optional:Change Router ID manually==
> R1(config-router)#router-id 1.1.1.1
> R1(config-router)#clear ip ospf process

OSPF Network Type

- Broadcast = fastEthernet 
- Point_to_Point = Serial

OSPF Link Count

- 2 = Serial (point-to-point: 1 - transmitter's IP address, 1 - receiver's IP address)
- 1 = fastEthernet
- 1 = loopback 
  ex. router with 2x serial interfaces, 1 fastEthernet and 1 loopback = Link Count of 6

OSPF Link Count ex.
R1 10.1.2.1 255.255.255.0 <-> R2 2.2.2.2

1) Point-to-Point (Link connecting to neighboring router)
   Link ID: 2.2.2.2
   Link Data: 10.1.2.1
2) Stub Network (Actual subnet on point-to-point link)
   Link ID: 10.1.2.0
   Link Data: 255.255.255.0

OSPF States
Full - Between DR and BDR
2WAY - Between DROTHER DR Other

**DR and BDR relations do not take place on Serial links
***DR, BDR or DROtherare elected per segment basis (only on multiaccess links), not per router. I.e. if R1 has g0/0 and g0/1, one can be DR and the other can be BDR

OSPF DR Election Process

1) Hello packets are exchanged via IP multicast packets on each segment
2) Router with highest OSPF priority on a segment becomes the DR (default OSPF priority = 1, do not elect = 0)
3) Process repeats for BDR
4) In case of tie, router with highest RID will win
5) Priority of 0 will become the DROTHER

**OSPF DR Election Priority

1) Highest priority 
2) Highest router ID
   **Router ID is not based on the interface's IP address, but on the highest IP address on the Router
   **Router ID must be UNIQUE
3) Highest Loopback IP address
4) Highest configured physical interface address

~Turning an expensive router into a PC

- Default gateway is set, therefore "no ip rout" was used

==Turn on logging==
R1(config)#logging console
==Turn on logging (telnet/ssh)==
R1(config)#term mon

***Router Types

- ABR Area Border Router - separate routers with different areas, always touch Backbone
- ASBR Autonomous System Border Router - seperates routers with different routing protocols (between EIRP and OSPF)
- Internal Router - does not touch other routers

==Convert EIGRP to OSPF (ABR Area Border Router)==

> Recall: EIGRP uses Bandwidth and Delay to determine best route
> Recall: OSPF only understands Bandwidth, therefore, we need to specify a seed metric
> R1(config)#router eigrp 100
> R1(config-router)#network 10.1.1.2 0.0.0.0
> Advertising OSPF in EIGRP
> R1(config-router)#router ospf 1
> R1(config-router)#network 10.1.2.1 0.0.0.0 area 1
> Advertising EIGRP in OSPF
> R1(config-router)#redistribute eigrp 100 
> R1(config-router)#redistribute ospf 1 metric 10000 1000 255 1 1500 [memorize this]

EIGRP1 <-> OSPF1(Area1) <-> OSPF2(Area0) <-> OSPF3 (Area0)
**OSPF3#show ip route

> OSPF2 is an "Intra-area OSPF Route" (local)
> OSPF1 is an "Inter-area OSPF Route" (different local)
> EIGRP1 is an "External route" (different routing protocol)

LSA Link State Advertisement

1) Router LSA (Type 1)
- Router ID of directly connected routers
2) Net LSA (Type 2)
- Router ID of intra-routers
3) Summary Net LSA (Type 3)
- Router ID of inter-routers
4) Summary ASB Autonomous System Border Router (Type 4)
- Router ID of ABRs Area Border Routers
5) Type 5 LSA
- Router ID of external LSA

**OSPF Areas must border/touch Area 0 (Backbone)
**All areas must be adjacent to Area 0
(GOOD) Area 1 <-> Area 0 <-> Area 2
(GOOD) Area 1 <-> Area 0 <-> Area 1
(BAD) Area 1 <-> Area 2 <-> Area 0 (Area 1 and not bordering Area 0 - otherwise Area 1 must attach to Area 0 via Virtual Link/Tunnel)

==Create Virtual Link/Tunnel==
**Virtual Links must use Router ID (not IP Address)
**Virtual Links are labelled "DNA" Do Not Age
**No election takes place on Virtual Links
R3 Area 0 (Router ID = 3.3.3.3) <-> Area 1 <-> R5 Area 2 (Router ID = 5.5.5.5)
R3(config)#router ospf 1

> Area 1 is the Area we can traversing
> R3(config-router)#area 1 virtual-link 5.5.5.5 
> From R5
> R5(config)#router ospf 1
> R5(config-router)#area 1 virtual-link 3.3.3.3

==Enable OSPF==
R1#config t
R1(config)#router ospf 1
R1(config-router)#network 0.0.0.0 255.255.255.0 area 0
==Enable EIGRP==
R1(config)#router eigrp 1
R1(config-router)#network 0.0.0.0
==Show commands==
R1#show ip route
R1#show ip bgp summary
R1#show ip bgp neigh
==No shutdown bgp neighbour==
R1(config)#router bgp 1
R1(config-router)#no neighbor 10.1.1.2 shutdown

Administrative distance
eBGP = 20
EIGRP = 90
OSPF = 110
RIP = 120
iBGP = 200

"Rib Failure" 

- from 'show ip bgp' indicates a route learned from a neighbor has lower administrative distance (static or other IGP Internet Gateway Protocol) in the routing table, therefore BGP route has failed to install into IP routing table (RIB Routing Information Base)

==Display ip routing protocols==
R1>en
R1#show ip proto
==Display the routing table==
R1#show ip route
==Display OSPF errors in real time==
R1#display ip ospf events
==Display OSPF neighbors==
R1#show ip ospf neigh
==Display OSPF interfaces==
R1#show ip ospf int
==Display OSPF everything==
R1#show ip ospf database

_______________________________________________________

==OSPF Simulations - Section514===

Enable OSPF using process number 1
Advertise network 10.0.0/8 in area 0 using a classful mask

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# router ospf 1
Router1(config-router)# network 10.0.0.0 0.255.255.255 area 0

_______________________________________________________

==OSPF Simulations - Section515===

Enable OSPF with process number 1
An IP address of 192.168.1.1/28 is configured on Ethernet 0. Advertise this network in OSPF area 0 using an exact network mask.
172.16.1.1/32 is configure on loopback 0. Advertise the loopback in area 1 using an exact network mask.

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# router ospf 1
Router1(config-router)# network 192.168.1.0 0.0.0.15 area 0
Router1(config-router)# network 172.16.1.1 0.0.0.0 area 1

_______________________________________________________

==OSPF Simulations - Section516===

Enable OSPF with process number 1
Router1's Ethernet IP address is 10.1.1.1/24
Router1's Serial 0/1 IP address is the first in the subnet in the diagram
Use host masks (32) to add both interfaces to area 0

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# router ospf 1
Router1(config-router)# network 10.1.1.1 0.0.0.0 area 0
Router1(config-router)# network 192.168.168.185 0.0.0.0 area 0

_______________________________________________________

==OSPF Simulations - Section517===

Enable OSPF on the routers with process id 1
Start with E0, then S0, then loop 0 and advertise each network using exact network masks
Inject a default route into the network on R1
Ethernet 0: 192.168.1.1/28 (Area 1)
Serial 0: 10.1.1.1/30 (Area 0)
Loopback 0: 172.16.1.1/32 (Area 0)

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# router ospf 1
Router1(config-router)# network 192.168.1.0 0.0.0.15 area 1
Router1(config-router)# network 10.1.1.0 0.0.0.3 area 0
Router1(config-router)# network 172.16.1.1 0.0.0.0 area 0
Router1(config-router)# default-information originate

_______________________________________________________

==OSPF Simulations - Section519===

Enable OSPF with process number 1. Put interfaces into OSPF using a host mask(/32)
Router is configured with the first IP address in the same subnet as host 10.185.185.255/25
Router is configured with the last IP address in the same subnet as host 172.16.195.195/23
Router is configured with the first IP address in the same subnet as 192.168.168.168/27

172.16.195.195 /23

195
128 64 X X X 4 X 1
                |
195

---

192.168.168.168 /27

168
128 X 32 X 8 X X X 
1 0 1 0 1 0 0 0
     |    
160

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# router ospf 1
Router1(config-router)# network 10.185.185.129 0.0.0.0 area 0
Router1(config-router)# network 172.16.195.254 0.0.0.0 area 0
Router1(config-router)# network 192.168.168.161 0.0.0.0 area 0

_______________________________________________________

***

==OSPF Simulations - Section523===

Configure plain text OSPF authentication on the FastEthernet 0/0 interface of Router 1
Use a password of cisco

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# int f0/0
Router1(config-if)# ip ospf authentication
Router1(config-if)# ip ospf authentication-key cisco

_______________________________________________________

***

==OSPF Simulations - Section527===

Configure OSPf with process id 1
Configure OSPF to load balance over 10 equal paths
Configure the OSPF cost of FastEthernet 0/0 to 100

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# router ospf 1
Router1(config-router)# maximum-paths 10
Router1(config-router)# int f0/0
Router1(config-if)# ip ospf cost 100
