First Hop Redundacy Protocols
**Think of your PC having 2 default gateways, but 2 default gateways is set on the switch/router rather than the PC itself
- Provides hop redundacy - incase one network gateway goes down, there is a second gateway available through the use of a standby virtual router
- Highest priority (100 is default, therefore we will set 200 as the highest priority) will be the 'active forwarder/router' for the VLAN
1) HSRP Hop Standby Routing Protocol
- Cisco Proprietary
2) VRRP Virtual Router Redundacy Protocol
- Industry standard

==Set HSRP Active==
We want to set Switch1 as the active forwarder (priority of 200, default = 100) for VLAN 10 (10.1.10.254/24) and Switch2
Switch1#conf t
Switch1(config)#int vlan 10
Switch1(config-if)#standby groupNumber (random) ip (ipAddressOfVlan)
Switch1(config-if)#standby 1 ip 10.1.10.254
Switch1(config-if)#standby 1 priority 200 
Switch1(config-if)#standby 1 preempt (makes sure Switch1 is the active forwarder when it is up. If it goes down and back up, it will force itself to be the active forwarder)
==Confirm this==
Switch1#show standby
**Because the router is virtual, it also gets a virtual HSRP MAC Address 0000.0c07.ac(hexadecimalOfGroup#)
**Virtual routers can use the same MAC address for mutliple VLANs because its Layer 2
Switch1#show running interface vlan 10
==Set HSRP Secondary==
Switch2#conf t
Switch2(config)#int vlan 10
Switch2(config-if)#standby groupNumber (random) ip (ipAddressOfVlan)
Switch2(config-if)#standby 1 ip 10.1.10.254
*Optional*Switch2(config-if)#standby 1 priority 100
==Change standby timers for quicker switchover==
Switch2(config-if)#standby 1 timers 1 3