# toplogy for ethernet channel

```
s1(config)#do sh his
  enable secret class
  line console 0
  password cisco
  login
  line vty 0 15
  password cisco
  login
  service password-encryption
  do sh his
  banner motd $ authorized user only!$
  s1#copy running-config startup-config 
  s1#clock set 18:47:00 21 aug 2021
```

On both switches create and name the required VLANs from the VLAN Table above

```
S1(config)# vlan 10
S1(config-vlan)# name Management
S1(config-vlan)# vlan 20
S1(config-vlan)# name Clients
S1(config-vlan)# vlan 999
S1(config-vlan)# name Parking_Lot
S1(config-vlan)# vlan 1000
S1(config-vlan)# name Native
S1(config-vlan)# exit

S2(config)# vlan 10
S2(config-vlan)# name Management
S2(config-vlan)# vlan 20
S2(config-vlan)# name Clients
S2(config-vlan)# vlan 999
S2(config-vlan)# name Parking_Lot
S2(config-vlan)# vlan 1000
S2(config-vlan)# name Native
S2(config-vlan)# exit
```

b. Configure and activate the management interface on each switch using the IP address information in the Addressing Table.

```
S1(config)# interface vlan 10
S1(config-if)# ip address 192.168.10.11 255.255.255.0
S1(config-if)# no shutdown
S1(config-if)# exit

S2(config)# interface vlan 10
S2(config-if)# ip address 192.168.10.12 255.255.255.0
S2(config-if)# no shutdown
S2(config-if)# exit
```

Assign all unused ports on the switch to the Parking_Lot VLAN, configure them for static access mode, and administratively deactivate them.

```
S1(config)# interface range f0/1-2
S1(config-if-range)# switchport mode trunk

S2(config)# interface range f0/1-2
S2(config-if-range)# switchport mode trunk

S1(config-if-range)# switchport trunk native vlan 1000

S2(config-if-range)# switchport trunk native vlan 1000
```
