Subnetting
ex. 172.16.35.123 /20 
== 172.16.01000011.123 255.255.240.0
Therefore 35 -> 0100 0011
0100 = network = 32
0011 = host = 3
*Network IP = 172.16.32.0 [all host = 0]
*1st IP = 172.16.32.1 [all host = 0, except for last = 1]
*Last IP = 172.16.47.254 [all host = 1, except for last = 0]
*Broadcast = 172.16.47.255 [all host = 1]

Subnetting
ex. 172.16.129.1 /17
== 172.16.10000001.1 255.255.128.0
Therefore 129 -> 1 000 0001
1 = network = 128
000 0001 = host = 1
*Network IP = 172.16.128.0 [all host = 0]
*1st IP = 172.16.128.1 [all host = 0, except for last = 1]
*Last IP = 172.16.255.254 [all host = 1, except for last = 0]
*Broadcast = 172.16.255.255 [all host = 1]

Subnetting and Networks

# of host of subnet = 2^n - 2 (network and broadcast)

# of networks = 2^n

ex. 10.1.1.0 /24 into subnets that support 14 machines

1) 2^4-2 = 16 - 2 = 14 machines. Therefore, we need a subnet of /28 (borrowing 4 bits)
2) Turn /24 into /28, 10.1.1.0 -> 10.1.1. 0000 | 0000
   So... 
   10.1.1.0 /28 (0000 | 0000)
   10.1.1.16 /28 (0001 | 0000)
   10.1.1.32 /28 (0010 | 0000)
   10.1.1.48 /28 (0011 | 0000)
   ...
   10.1.1.240 /28 (not 254 because 255.255.255.240 = /28 or 1111|0000 - remember .240 because host portion remains 0))

Subnetting and Networks
ex. 10.128.192.0 /18 requires 30 subnets as many hosts as possible

# of networks (subnets) = 2^5, therefore n=5 (borrow 5 bits)

/18 = 255.255.192.0
192 -> 11 | 000000
We need to borrow 5 bits, therefore /18 -> /23 and 11|000000 becomes 1100000|0
So...
10.128.192.0 /23 (1100000|0)
10.128.194.0 /23 (1100001|0)
10.128.196.0 /23 (1100010|0)
10.128.198.0 /23 (1100011|0)
...
10.128.254.0 /23 (1111111|0 - remember 254.0 because host portion remains 0)

ex. What is the network address for 172.16.1.1 with network mask 255.255.192.0?
network mask = 255.255.192.0 = /18 or 11 | 000000 (host)
-> Make all host = 0 to find network address, therefore 172.16.0.0 /18

ex. What is the broadcast address for host 172.16.1.1 with network mask 255.255.192.0?
network mask 255.255.192.0 = /18 or 11 | 000000. 00000000 (host)
-> Make all host = 1 to find broadcast address, therefore 172.16.63.255 /18

ex. PC's ip address is 192.168.1.130/27, configure the router's Ethernet 0 interface with the last IP address in the same subnet
-> /27 = 255.255.255.224 or 100 | 00010
-> Therefore, last ip address = broadcast - 1
-> Set hosts = 1, 100 | 11111 = 159, 159 - 1 = 158 
-> Therefore, router's Ethernet 0 interface should be 192.168.1.158 /27
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0
Router1(config-if)#ip address 192.168.1.158 255.255.255.224

ex. Configure the router's serial interface (Serial 0/1) with the last IP address in the subnet 192.168.168.184/30, then enable the router's interface
-> /30 = 255.255.255.252 or 101110|00
-> Therefore, last ip address = broadcast - 1
-> Set hosts = 1, 187 - 1 = 186
-> Therefore, 192.168.168.186 255.255.255.252
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface serial 0/1
Router1(config-if)#ip address 192.168.168.186 255.255.255.252
Router1(config-if)#no shutdown

ex. Configure the router's Ethernet 0 interface with the last IP address in the same subnet as PC in the diagram. Note 2: PC's address is 172.16.197.231/23
-> .197 /23 = 1100010 | 1
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0
Router1(config-if)#ip address 172.16.197.254 255.255.254.0 (Note* Not 255, because that is broadcast)

ex. Configure the router's Ethernet 0/0 interface with the 2nd IP address in the same subnet as PC in the Diagram. Note: The PC's address is 172.16.197.231/23
-> 197 /23 1100010 | 1
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0/0
Router1(config-if)#ip address 172.16.196.2 255.255.254.0

ex. Your router is the same subnet as host 10.199.199.199/26. 
Configure the router's Ethernet 0/0 interface with the first IP address in the subnet
-> 199 @ /26 = 11 | 00 0111
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0/0
Router1(config-if)#ip address 10.199.199.193 255.255.255.192

ex. Your router is the same subnet as host 10.199.199.199/22. 
Configure the router's Ethernet 0 interface with the first IP address in the subnet.
-> 199 @ /22 = 1100 01|11
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0
Router1(config-if)#ip address 10.199.196.1 255.255.252.0

ex. Your router is the same subnet as host 10.199.199.199/22. 
Configure the router's Ethernet 0 interface with the last IP address in the subnet
-> 199 @ /22 = 1100 01|11
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0
Router1(config-if)#ip address 10.199.199.254 255.255.252.0

ex. Your router is the same subnet as host 10.10.10.10/21. 
Configure the router's Ethernet 0 interface with the first IP address in the subnet
-> .10 /21 = 00001 | 010
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0
Router1(config-if)#ip address 10.10.8.1 255.255.248.0

ex. Your router is the same subnet as host 10.10.10.10/21. 
Configure the router's Ethernet 0 interface with the last IP address in the subnet
-> .10 /21 = 00001 | 010
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0
Router1(config-if)#ip address 10.10.15.254 255.255.248.0

ex. Your router is the same subnet as host 172.172.172.172/25
Configure the router's Ethernet 0 interface with the first IP address in the subnet
-> .172 /25 = 1 | 0101100
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0
Router1(config-if)#ip address 172.172.172.129 255.255.255.128

ex. Your router is in the same subnet as host 172.172.172.172/25
Configure the router's Ethernet 0 interface with the last IP address in the subnet
-> .172 /25 = 1 | 0101100
[PROGRAM]
Router1>enable
Router1#conf t
Router1(config)#interface ethernet 0
Router1(config-if)#ip address 172.172.172.254 255.255.255.128

ex. Can 10.1.1.1 ping 10.1.2.1?
-> You don't know until you know its submask
-> If we are given /24, can we stil ping it? No, because /24 is 255.255.255.0 and (10.1.1).1 is the network for the 1st ip address and (10.1.2).1 is on another network. Hence, not able to ping to each other
-> If we are given /16, can we still ping it? Yes, because /16 is 255.255.0.0 and (10.1).1.1 = (10.1).2.1 and 10.1 is the network on both devices

ex. For the network 192.168.1.0 /24, how to support 60 hosts?

1) Find host bits. 2^6 host bits = 64 hosts per subnet
2) From /24 = 11111111 11111111 11111111 00000000 
   -> Borrowing 6 host bits, /24 becomes /26 11111111 11111111 11111111 11000000 
   192.168.1.0 /26
   192.168.1.64 /26
   192.168.1.128 /26
   192.168.1.192 /26

ex. Get 2 routers connected to talk to each other
Router1> enable
Router1# conf t
Router1(config)#router eigrp 100 [to enable full connectivity]
Router1(config-router)# network 192.168.1.0
Router1(config-router)# no auto-summary
Router2> enable
Router2# conf t
Router2(config)#router eigrp 100 [to enable full connectivity]
Router2(config-router)# network 192.168.1.0
Router2(config-router)# no auto-summary
[confirm it is working]
Router1# show ip eigrp neighbors 
Router1# show ip route [see what's connected]

ex. Subnet 192.168.1.128 /26 to allow it to host only 2 hosts

1) To host 2 hosts, we only require 2 host bits. Therefore 255.255.255.252 or /30 or 10 (network) | 00 00 (new subnet) | 00 (new host)

2) # of new subnets with 2 host bits is 2^(network bits borrowed) = 2^4 = 16 new subnets
   
   Therefore new subnets would be:
   192.168.1.128 /30 (10 (network) | 00 00 (new subnet) | 00 (new host))
   192.168.1.132 /30 (10 (network) | 00 01 (new subnet) | 00 (new host))
   192.168.1.136 /30 (10 (network) | 00 10 (new subnet) | 00 (new host))
   ... /30
   192.168.1.188 /30 (10 (network) | 11 11 (new subnet) | 00 (new host))
